package chapter4_controlStructures;

// Напишите программу, которая выводит число от 1 до 100
public class ExFor {
    public static void main(String[] args) {
        for (int i = 1; i <= 100; i++) {
            System.out.println(i + " ");
        }
    }
}
